rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "dfadsfasdf"], ["updated_at", "2018-11-07 04:22:34.103685"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    puts params
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def similar_movies
    movie = Movie.find(params[:movie_id])